<script setup>

</script>

<template>
    <section class="rool" id="rool">
        <h1 class="my-6">ПРАВИЛА</h1>
            <ol class="rool-text">
                <li>Перемещать можно только одну фишку за ход.</li>
                <li>Фишка может быть перемещена на свободное соседнее 
                            поле в любом из четырех направлений (вверх, вниз, влево, вправо).</li>
                <li>Если фишка оказывается в правильной позиции, но имеет неправильный номер, ее можно “перевернуть” на нужный номер.</li>
                <li>Игра завершается, когда все фишки упорядочены по возрастанию номеров и последняя фишка остается свободной.</li>
                <li>Сложность игры заключается в поиске оптимальной стратегии и определении порядка перемещения фишек для достижения цели.</li>
            </ol>
    </section>
</template>

<style scoped>

</style>